OpenFOAM-9/chapter2/ellipsoidal/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    
    front    
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    fixedWall
    { 
	type		zeroGradient;  
    }
    bottom
    {
	type		zeroGradient;
    }
    top
    {
	type		zeroGradient;	  
    }
   axis            
    {
	type		empty;
    }
    	
}


// ************************************************************************* //
